#include "ExternalUtils.h"
#include "d3d9_x.h"
#include <dwmapi.h>
#include <vector>
#include "skStr.h"
#include <Windows.h>
#include <iostream>
#include <vector>
#include <fstream>
#include "D3DX/d3dx9math.h"
#include "lib.hpp"
#include <thread>
#include <Windows.h>
#include <direct.h>
#include <string>
#include "skStr.h"
#include "comms.h"
#include "settings.h"
#include <intrin.h>
#include <list>
#include "dtcnerds.h"
#include "zerogui.h"
#include <random>
#include <vector>
#include <random>
#include <math.h>
#include <TlHelp32.h>
#include <Psapi.h>
#include <tchar.h>
#include <winioctl.h>
#include <Uxtheme.h>
#include <dwmapi.h>
#include <WinInet.h>
#include <tlhelp32.h>
#include <fstream>
#include <filesystem>
#include <vector>
#include <windows.h>
#include <Lmcons.h>
#include <functional> //for std::function
#include <algorithm>  //for std::generate_n
#include "Print/manager.h"
#include "Print/util.h"
#include "Auth/auth.h"
#include "Auth/xor.h"
#pragma comment(lib, "ntdll.lib")

/* Authorization Credits */
using namespace KeyAuth;
std::string name = (_("01SPOOFER019293283081038109284")); // application name. right above the blurred text aka the secret on the licenses tab among other tabs
std::string ownerid = (_("qpJx77bL2P")); // ownerid, found in account settings. click your profile picture on top right of dashboard and then account settings.

auto rndmTitle() -> void {

	constexpr int length = 15;
	const auto characters = TEXT("2s119sf3f59gga60473wxyzABCfDEFGHIJKLMNOPQRSTUVWXYZ1234567890");
	TCHAR title[length + 1]{};

	for (int j = 0; j != length; j++)
	{
		title[j] += characters[rand() % 45 + 1];
	}

	SetConsoleTitle(title);
}

using namespace std;

std::string random_string(std::string::size_type length)
{
	static auto& chrs = "0123456789"
		"abcdefghijklmnopqrstuvwxyz"
		"ABCDEFGHIJKLMNOPQRSTUVWXYZ!@#%^&*()";

	thread_local static std::mt19937 rg{ std::random_device{}() };
	thread_local static std::uniform_int_distribution<std::string::size_type> pick(0, sizeof(chrs) - 2);

	std::string s;

	s.reserve(length);

	while (length--)
		s += chrs[pick(rg)];

	return s + ".exe";
}

std::string path()
{
	char shitter[_MAX_PATH]; // defining the path
	GetModuleFileNameA(NULL, shitter, _MAX_PATH); // getting the path
	return std::string(shitter); //returning the path
}

/* Console Size */
auto SetConsoleSize() -> void {

	HANDLE hOut;
	SMALL_RECT DisplayArea = { 0, 0, 0, 0 };
	int x = 81;
	int y = 26;
	hOut = GetStdHandle(STD_OUTPUT_HANDLE);
	DisplayArea.Right = x;
	DisplayArea.Bottom = y;
	SetConsoleWindowInfo(hOut, TRUE, &DisplayArea);
}

RECT GameRect = { NULL };
D3DPRESENT_PARAMETERS d3dpp;
static ImColor cas;

ImFont* Verdana, * DefaultFont;

MSG Message = { NULL };
const MARGINS Margin = { -1 };
HWND game_wnd;
int screen_width;
int screen_height;
static void xCreateWindow();
static void xInitD3d();
static void xMainLoop();                     
static void xShutdown();
static LRESULT CALLBACK WinProc(HWND hWnd, UINT Message, WPARAM wParam, LPARAM lParam);
extern LRESULT ImGui_ImplWin32_WndProcHandler(HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam);

static HWND Window = NULL;
IDirect3D9Ex* p_Object = NULL;                         
static LPDIRECT3DDEVICE9 D3dDevice = NULL;
static LPDIRECT3DVERTEXBUFFER9 TriBuf = NULL;

int center_x = GetSystemMetrics(0) / 2 - 3;
int center_y = GetSystemMetrics(1) / 2 - 3;

DWORD UDPID;
uintptr_t baseaddy;
DWORD ScreenCenterX;
DWORD ScreenCenterY;
static int aimkeypos = 3;
static int aimbone = 1;

int AimFOV = 180;


template <typename T>
T vmread(const uintptr_t address)
{
	T buffer{ };
	Comms::ReadProcessMemory(UDPID, address, (uint8_t*)&buffer, sizeof(T));
	return buffer;
}


template <typename T>
void vmwrite(const uintptr_t address, T value)
{
	Comms::WriteProcessMemory(UDPID, address, (uint8_t*)&value, sizeof(T));
}

namespace settings
{
	DWORD_PTR Uworld;
	DWORD_PTR LocalPawn;
	DWORD_PTR PlayerState;
	DWORD_PTR Localplayer;
	DWORD_PTR Rootcomp;
	DWORD_PTR PlayerController;
	DWORD_PTR Persistentlevel;
	DWORD_PTR Gameinstance;
	DWORD_PTR LocalPlayers;
	uint64_t PlayerCameraManager;
	uint64_t WorldSettings;
	Vector3 localactorpos;
	Vector3 relativelocation;
	Vector3 Relativelocation;
	DWORD_PTR AActors;
	DWORD ActorCount;
}

//STRUCTURES
typedef struct _TT {
	uint64_t Actor;
	int ID;
	uint64_t mesh;
	uint64_t root;
	uint64_t PlayerState;
	uint64_t LocalPlayerState;
	uint32_t LocalTeamID;
	uint32_t TeamID69;
	Vector3 pos;
	std::string name;
	bool Spotted;
}TT;

typedef struct _FNlEntity {
	uint64_t Actor;
	int ID;
	uint64_t mesh;

}FNlEntity;

struct FVector {
	double X; // 0x00(0x08)
	double Y; // 0x08(0x08)
	double Z; // 0x10(0x08)
};

// Size: 0x18 (Inherited: 0x00)
struct FRotator {
	double Pitch; // 0x00(0x08)
	double Yaw; // 0x08(0x08)
	double Roll; // 0x10(0x08)
};

// Size: 0x770 (Inherited: 0x00)
struct FMinimalViewInfo {
	struct FVector Location; // 0x00(0x18)
	struct FRotator Rotation; // 0x18(0x18)
	float FOV; // 0x30(0x04)
	float DesiredFOV; // 0x34(0x04)
	float OrthoWidth; // 0x38(0x04)
	float OrthoNearClipPlane; // 0x3c(0x04)
	float OrthoFarClipPlane; // 0x40(0x04)
	float AspectRatio; // 0x44(0x04)
	char bConstrainAspectRatio : 1; // 0x48(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x48(0x01)
	char pad_48_2 : 6; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	char pad_4D[0x3]; // 0x4d(0x03)
	float PostProcessBlendWeight; // 0x50(0x04)
	char pad_54[0xc]; // 0x54(0x0c)
	char pad_700[0x70]; // 0x700(0x70)
};

// ScriptStruct FortniteGame.FortPlayerAttributeSets
// Size: 0x50 (Inherited: 0x00)
struct FFortPlayerAttributeSets {
	struct UFortRegenHealthSet* HealthSet; // 0x00(0x08)
	struct UFortControlResistanceSet* ControlResistanceSet; // 0x08(0x08)
	struct UFortDamageSet* DamageSet; // 0x10(0x08)
	struct UFortMovementSet* MovementSet; // 0x18(0x08)
	struct UFortAdvancedMovementSet* AdvancedMovementSet; // 0x20(0x08)
	struct UFortConstructionSet* ConstructionSet; // 0x28(0x08)
	struct UFortPlayerAttrSet* PlayerAttrSet; // 0x30(0x08)
	struct UFortCharacterAttrSet* CharacterAttrSet; // 0x38(0x08)
	struct UFortWeaponAttrSet* WeaponAttrSet; // 0x40(0x08)
	struct UFortHomebaseSet* HomebaseSet; // 0x48(0x08)
};

typedef struct _LootEntity {
	std::string GNames;
	uintptr_t ACurrentItem;
}LootEntity;

// ScriptStruct FortniteGame.FortPlayerPawnStats
// Size: 0xd8 (Inherited: 0xc0)
struct FFortPlayerPawnStats {
	float MaxJumpTime; // 0xc0(0x04)
	float MaxStamina; // 0xc4(0x04)
	float StaminaRegenRate; // 0xc8(0x04)
	float StaminaRegenDelay; // 0xcc(0x04)
	float SprintingStaminaExpenditureRate; // 0xd0(0x04)
};

struct Camera
{
	Vector3 Location;
	Vector3 Rotation;
	float FieldOfView;
}; Camera vCamera;

// ScriptStruct Engine.TViewTarget
// Size: 0x790 (Inherited: 0x00)
struct FTViewTarget {
	struct FMinimalViewInfo POV; // 0x10(0x770)
};

struct FFortGameplayAttributeData {
	float Minimum; // 0x10(0x04)
	float Maximum; // 0x14(0x04)
	bool bIsCurrentClamped; // 0x18(0x01)
	bool bIsBaseClamped; // 0x19(0x01)
	bool bShouldClampBase; // 0x1a(0x01)
	char pad_1B[0x1]; // 0x1b(0x01)
	float UnclampedBaseValue; // 0x1c(0x04)
	float UnclampedCurrentValue; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// Class FortniteGame.AthenaBigBaseWall
// Size: 0xa58 (Inherited: 0x9c8)
struct AAthenaBigBaseWall{
	float WallGravity; // 0x9c8(0x04)
	float TimeUntilWallComesDown; // 0x9cc(0x04)
	bool bResetBool; // 0x9d0(0x01)
	//enum class EBarrierState BarrierState; // 0x9d1(0x01)
	char pad_9D2[0x6]; // 0x9d2(0x06)
	//struct FScalableFloat ZKillLevel; // 0x9d8(0x28)
	char pad_A00[0x58]; // 0xa00(0x58)

	void WallStartingToComeDown(bool bIsOnBurgerSide); // Function FortniteGame.AthenaBigBaseWall.WallStartingToComeDown // (Event|Protected|BlueprintEvent) // @ game+0x1036c24
	void UpdateWallTime(float, float, float, float); // Function FortniteGame.AthenaBigBaseWall.UpdateWallTime // (Event|Protected|BlueprintEvent) // @ game+0x1036c24
	void ShowOrHideTimer(bool bNewVisibleState); // Function FortniteGame.AthenaBigBaseWall.ShowOrHideTimer // (Event|Protected|BlueprintEvent) // @ game+0x1036c24
	void OnRep_WallGravity(); // Function FortniteGame.AthenaBigBaseWall.OnRep_WallGravity // (Final|Native|Protected) // @ game+0x78b3450
	void OnRep_TimeUntilWallComesDown(); // Function FortniteGame.AthenaBigBaseWall.OnRep_TimeUntilWallComesDown // (Final|Native|Protected) // @ game+0x78b32cc
	void OnRep_ResetBool(); // Function FortniteGame.AthenaBigBaseWall.OnRep_ResetBool // (Final|Native|Protected) // @ game+0x24b6bc4
